<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Mendeley Desktop for Windows.</string>
    <key>Identifier</key>
	<string>com.github.autopkg-win.download.Mendeley-Desktop-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mendeley-Desktop</string>
        <key>DOWNLOAD_URL</key>
        <string>http://www.mendeley.com/client/get/1/</string>
        <key>VERSION_URL</key>
		<!-- Mendeley-Desktop-1.19.8-win32.exe -->
        <string>Mendeley-Desktop-(?P&lt;version&gt;([0-9]+\.)*[0-9]+)-win32\.exe</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 6.1; WOW64; Trident/7.0; AS; rv:11.0) like Gecko</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
	    <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
			<key>Comment</key>
			<string>Get the headers to extract the version from the filename</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.mendeley.com/autoupdates/installer/Windows-x86/stable-incoming</string>
                <key>re_pattern</key>
                <string>%VERSION_URL%</string>
				<key>curl_opts</key>
				<array>
					<string>--head</string>
				</array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>request_headers</key>
                <dict>
                        <key>user-agent</key>
                        <string>%USER_AGENT%</string>
                </dict>
				<key>curl_opts</key>
				<array>
					<string>--location</string>
				</array>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
			<key>Comment</key>
			<string>Check the signature on the downloaded file</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
				<string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN=Elsevier Ltd, O=Elsevier Ltd, L=Kidlington, C=GB</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>