<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Alters latest AdoptOpenJDK 11 JRE Hotspot x64 MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.NickETH.build.AdoptOpenJDK11JRE-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdoptOpenJDK_JRE_Hotspot</string>
        <key>SEARCH_URL</key>
		<string><![CDATA[https://api.adoptopenjdk.net/v2/latestAssets/releases/openjdk11?os=windows&arch=x64&heap_size=normal&openjdk_impl=hotspot&type=jre]]></string>
        <key>DOWNLOAD_FILE</key>
        <string>OpenJDK11U</string>
        <key>PLATFORM</key>
        <string>x64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.NickETH.download.AdoptOpenJDKMSI-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>pkg_dir</key>
                <string>AdoptOpenJDK_JRE_Hotspot_64_%version%_ML</string>
                <key>folder_list</key>
                <string>sourceunzipped:release:read:helpers</string>
				<!--
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
				-->
			</dict>
		</dict>
		<!--
		-->
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\%DOWNLOAD_FILE%-JRE_hotspot_%PLATFORM%_%version%.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\AdoptOpenJDK_JRE_Hotspot_64_%version%_ML.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
		<!--
		-->
        <dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/MSIApplySumInfo</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\AdoptOpenJDK_JRE_Hotspot_64_%version%_ML.msi</string>
				<key>cmnds_sinfo</key>			
				<dict>
				    <key>/o</key>
                    <string>Slightley altered version for mass deployment.</string>
				    <key>/j</key>
                    <string>AdoptOpenJDK JRE Hotspot x64 %version% ML</string>
				    <key>/t</key>
                    <string>AdoptOpenJDK JRE Hotspot x64 %version% ML</string>
				</dict>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>