<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest SEH UTN Manager Installer for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.UTN_Manager-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>UTN_Manager</string>
        <key>SEARCH_URL</key>
        <string>https://www.seh-technology.com/de/service/downloads/download-dongleserver/dongleserver-pro.html</string>
		<key>VERSION_URL</key>
		<!-- https://www.seh-technology.com/fileadmin/user/downloads/deviceserver/tools/sehutnmanager-win-3.3.4.zip -->
		<string>(/fileadmin/user/downloads/deviceserver/tools/sehutnmanager-win-(?P&lt;version&gt;([0-9]+\.)*[0-9]+)\.zip)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%VERSION_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.seh-technology.com%match%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>