<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Alters latest Keepass MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.Keepass-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Keepass</string>
        <key>PLATFORM</key>
        <string>x86</string>
        <key>ZULUPLATFORM</key>
        <string>i686</string>
        <key>ZULUPRODUCT</key>
        <string>jre</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.Keepass-LANG</string>
    <key>Process</key>
    <array>
<!--         <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
			<key>Comment</key>
			<string>Uses the Python eval function, looking at download_changed</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>pkg_dir</key>
                <string>Keepass_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>Keepass_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>prop_file</key>
                <string>wixproject\global.prop</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-Keepass_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-Keepass_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%NAME%.msi</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\%NAME%_%build_ver%.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%NAME%.msi</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\%NAME%_%build_ver%_ML.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%NAME%-ger.zip</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-ger.zip</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%NAME%-fra.zip</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-fra.zip</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%NAME%-ita.zip</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-ita.zip</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%NAME%-spa.zip</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-spa.zip</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>run_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/NANTrun</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQL</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\Keepass_%build_ver%_ML.msi</string>
                <key>SQL_command</key>
				<array>
                    <string><![CDATA[INSERT INTO `Feature` (`Feature`.`Feature`,`Feature`.`Feature_Parent`,`Feature`.`Title`,`Feature`.`Description`, `Feature`.`Display`,`Feature`.`Level`,`Feature`.`Directory_`,`Feature`.`Attributes`) VALUES ('LangAndConfig','','LangAndConfig','Language and Config',11,1,'TARGETDIR',8)]]></string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQL</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\Keepass_%build_ver%_ML.msi</string>
                <key>SQL_command</key>
				<array>
                    <string><![CDATA[DELETE FROM `Shortcut` WHERE `Shortcut`.`Directory_` = 'DesktopFolder']]></string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIimportMergeModule</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_dir_abs</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\Keepass_%build_ver%_ML.msi</string>
                <key>msm_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\Keepass_%version%.msm</string>
                <key>msm_feature</key>
                <string>LangAndConfig</string>
                <key>msm_dir</key>
                <string>TARGETDIR</string>
                <key>temp_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\helpers</string>
                <key>log_file_abs</key>
                <string>%BUILD_DIR%\%pkg_dir%\helpers\MSM-log.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIApplySumInfo</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\Keepass_%build_ver%_ML.msi</string>
				<key>cmnds_sinfo</key>			
				<dict>
				    <key>/o</key>
                    <string>Version %version% with Langpacks and Cfg for ETHZ ID. %us_date% by AutoPkg</string>
				    <key>/j</key>
                    <string>Keepass %version% ML</string>
				    <key>/t</key>
                    <string>Keepass %version% ML</string>
				</dict>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>