<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Keepass language packs for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.Keepass-LANG</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Keepass</string>
        <!-- <key>SEARCH_URL_MSI</key> -->
		<!-- <string>https://sourceforge.net/projects/keepass/files/KeePass%202.x/2.43/KeePass-2.43.msi/download</string> -->
		<!-- https://sourceforge.net/projects/keepass/files/Translations%202.x/2.43/KeePass-2.43-German.zip/download -->
		<!-- https://sourceforge.net/projects/keepass/files/Translations%202.x/2.43/KeePass-2.43-French.zip/download -->
		<!-- https://sourceforge.net/projects/keepass/files/Translations%202.x/2.43/KeePass-2.43-Italian.zip/download -->
		<!-- https://sourceforge.net/projects/keepass/files/Translations%202.x/2.43/KeePass-2.43-Spanish.zip/download -->
		<!-- <string>(?P&lt;msi_dl_link&gt;https://sourceforge\.net/projects/keepass/files/KeePass%20[0-9]\.x/([0-9]+\.)*[0-9]+/KeePass-(?P&lt;ver_major&gt;[0-9]+)\.(?P&lt;ver_minor&gt;[0-9]+)(\.(?P&lt;ver_build&gt;[0-9]+))?.msi/download)</string> -->
        <key>SEARCH_URL_GER</key>
		<string>(?P&lt;trans_dl_link_ger&gt;https://sourceforge\.net/projects/keepass/files/Translations%20[0-9]\.x/([0-9]+\.)*[0-9]+/KeePass-([0-9]+\.)*[0-9]+-German.zip/download)</string>
        <key>SEARCH_URL_FRA</key>
		<string>(?P&lt;trans_dl_link_fra&gt;https://sourceforge\.net/projects/keepass/files/Translations%20[0-9]\.x/([0-9]+\.)*[0-9]+/KeePass-([0-9]+\.)*[0-9]+-French.zip/download)</string>
        <key>SEARCH_URL_ITA</key>
		<string>(?P&lt;trans_dl_link_ita&gt;https://sourceforge\.net/projects/keepass/files/Translations%20[0-9]\.x/([0-9]+\.)*[0-9]+/KeePass-([0-9]+\.)*[0-9]+-Italian.zip/download)</string>
        <key>SEARCH_URL_SPA</key>
		<string>(?P&lt;trans_dl_link_spa&gt;https://sourceforge\.net/projects/keepass/files/Translations%20[0-9]\.x/([0-9]+\.)*[0-9]+/KeePass-([0-9]+\.)*[0-9]+-Spanish.zip/download)</string>	
	 <key>DOWNLOAD_FILE</key>
        <string>Keepass</string>
        <key>ver_build</key>
        <string>0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.Keepass-MSI</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
			<key>Comment</key>
			<string>Uses the Python eval function, looking at download_changed</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://sourceforge.net/api/file/index/project-id/95013/rss</string>
                <key>re_pattern</key>
                <string>%SEARCH_URL_GER%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <!-- <string>%DOWNLOAD_URL%</string>  -->
				<string>%trans_dl_link_ger%</string>
                <key>filename</key>
                <string>%NAME%-ger.zip</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <string>False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://sourceforge.net/api/file/index/project-id/95013/rss</string>
                <key>re_pattern</key>
                <string>%SEARCH_URL_FRA%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<string>%trans_dl_link_fra%</string>
                <key>filename</key>
                <string>%NAME%-fra.zip</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <string>False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://sourceforge.net/api/file/index/project-id/95013/rss</string>
                <key>re_pattern</key>
                <string>%SEARCH_URL_ITA%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<string>%trans_dl_link_ita%</string>
                <key>filename</key>
                <string>%NAME%-ita.zip</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <string>False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://sourceforge.net/api/file/index/project-id/95013/rss</string>
                <key>re_pattern</key>
                <string>%SEARCH_URL_SPA%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<string>%trans_dl_link_spa%</string>
                <key>filename</key>
                <string>%NAME%-spa.zip</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <string>False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>