<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current Fiji release to an MSI-package. It uses the latest stable version of Fiji without JRE in it. Therefore a version of JRE or JDK has to be present on the client. Fiji is an image processing package and can be described as a distribution of ImageJ (and ImageJ2) together with a lot of plugins organized into a coherent menu structure.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.Fiji-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Fiji-Win64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg-win.download.Fiji-Win64</string>

    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
            <string>Create a build enviroment to build the MSI with Wix</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>2</string>
                <key>pkg_dir</key>
                <string>Fiji_64_%version%_EN</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the Fiji zip file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%filename%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the autopkg zip archive</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>preserve_paths</key>
                <string>True</string>
                <key>extract_file</key>
                <string>*</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
			<key>Comment</key>
			<string>Delete the expanded files and folders in the cache</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
				<array>
                    <string>%BUILD_DIR%\%pkg_dir%\wixproject\Fiji.app\java</string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-Fiji_64_%build_ver%_EN.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-Fiji_64_%build_ver%_EN.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
			<key>Comment</key>
            <string>Set the actual version strings to the version.wxi file</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%version_intern%</string>
                <key>org_ver</key>
                <string>%version_intern%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSBuildRun</string>
			<key>Comment</key>
            <string>Run the MSBuild script to generate the Fiji MSI installer</string>
            <key>Arguments</key>
            <dict>
                <key>build_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\Fiji.build</string>
                <key>build_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>build_target</key>
                <string>WIX</string>
                <key>build_property</key>
                <string>BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;FijiDir=%BUILD_DIR%\%pkg_dir%\wixproject\Fiji.App;version=%version%</string>
            </dict>
        </dict>
		<!-- Todo: Why does this processor throw an error? -->
		<!--	<dict>
            <key>Processor</key>
            <string>PathDeleter</string>
			<key>Comment</key>
			<string>Delete the temp file in the release folder</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
				<array>
                    <string>%BUILD_DIR%\%pkg_dir%\release\Fiji*.wixpdb</string>
				</array>
			</dict>
		</dict> -->
	</array>
</dict>
</plist>
