<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for Bitwarden Desktop x64.</string>
	<key>Identifier</key>
	<string>com.github.autopkg-win.download.BitwardenDesktop-Win64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>BitwardenDesktop</string>
		<key>URL</key>
        <string>https://mifi.no/losslesscut/</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>PF_STRING</key>
        <string>_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>bitwarden/desktop</string>
				<key>asset_regex</key>
				<!-- Bitwarden-1.32.1-x64.nsis.7z (?P&lt;version&gt;([0-9]+\.)*[0-9]+) -->
				<string>Bitwarden-([0-9]+\.)*[0-9]+-x64.nsis\.7z</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
			    <key>filename</key>
                <string>%NAME%-x64.exe</string>
            </dict>
        </dict>
        <!-- <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>E=winmergejp@gmail.com, CN=Takashi Sawanaka, O=Takashi Sawanaka, S=Chiba, C=JP</string>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>