<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Alters latest SafeExamBrowser MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.SafeExamBrowser-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SafeExamBrowser</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>PF_STRING</key>
        <string>_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.SafeExamBrowser-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
			<string>Create the build environment</string>

            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>pkg_dir</key>
                <string>%NAME%%PF_STRING%_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourceunzipped:release:read:helpers</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%NAME%%PF_STRING%_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the SafeExamBrowser setup exe</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped</string>
                <key>preserve_paths</key>
                <string>False</string>
                <key>archive_type</key>
                <string>#</string>
                <key>extract_file</key>
                <string>4.cab</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the SafeExamBrowser setup exe</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\4.cab</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped</string>
                <key>preserve_paths</key>
                <string>False</string>
                <key>archive_type</key>
                <string>*</string>
                <key>extract_file</key>
                <string>a0</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
			<key>Comment</key>
            <string>Move the SafeExamBrowser x64 MSI file to the release dir</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\a0</string>
                <key>target</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSITransformer</string>
			<key>Comment</key>
			<string>Applies the Settings-Transform to the SafeExamBrowser.msi to the release folder</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi</string>	
                <key>mst_paths</key>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\SEB_Uninst-log-Rem-Chng-Add-SC.mst</string>
                <key>mode</key>
                <string>-a</string>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>