<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Adoptium IcedTea-Web MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.AdoptiumIcedTeaWeb-Win64</string>
    <key>Input</key>
    <dict>
		<key>GITHUB_REPO</key>
		<string>AdoptOpenJDK/IcedTea-Web</string>
		<key>NAME</key>
		<string>IcedTea-Web</string>
        <key>PLATFORM</key>
        <string>x64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
				<key>asset_regex</key>
				<string>icedtea-web-[0-9\.]+[0-9]\.msi</string>
				
			</dict>
		</dict>
		<!--
		-->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%_%PLATFORM%.msi</string>
                <!-- <key>CHECK_FILESIZE_ONLY</key>
                <string>False</string> -->
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQLget</string>
			<key>Comment</key>
			<string>Get the version from the MSI file</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%pathname%</string>
                <key>SQL_command</key>
                <string><![CDATA[SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion']]></string>
				<!-- %msi_value% -->
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%msi_value%</string>
                <key>rename_var</key>
                <string>version</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>