<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current Git commit of the win branch of autopkg.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.AutoPkg-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AutoPkg</string>
        <key>URL</key>
        <string>https://github.com/NickETH/autopkg/zipball/win</string>
        <key>PLATFORM</key>
        <string>x86</string>
        <key>PF_STRING</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
	<string>com.github.autopkg-win.download.AutoPkg-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
			<string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
            <string>Create a build enviroment to build the MSI with Wix</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>pkg_dir</key>
                <!-- <string>%NAME%_%version%</string> -->
				<string>%NAME%%PF_STRING%_::VVeerrssiioonn::</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%NAME%%PF_STRING%_%build_ver%</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the autopkg zip archive</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped</string>
                <key>preserve_paths</key>
                <string>True</string>
                <key>archive_type</key>
                <string>*:r</string>
                <key>extract_file</key>
                <string>*</string>
                <key>recursive</key>
                <string>True</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
			<key>Comment</key>
            <string>Get the full path to the directory with the extracted AutoPkg files</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\*-autopkg-*</string>
            </dict>
        </dict>	
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the AutoPkg files to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%\Code</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\AutoPkg</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
			<key>Comment</key>
			<string>Delete the expanded files and folders in the cache</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
				<array>
                    <string>%BUILD_DIR%\%pkg_dir%\wixproject\AutoPkg\APkgUtils\Service-Install_AutoPkgTaskRunner.ps1</string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-AutoPkg_%build_ver%_EN.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
			<string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-AutoPkg_%build_ver%_EN.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
			<string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
			<string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
			<key>Comment</key>
            <string>Set the actual version strings to the version.wxi file</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%version%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSBuildRun</string>
			<key>Comment</key>
            <string>Run the MSBuild script to generate the AutoPkg.Win MSI installer</string>
            <key>Arguments</key>
            <dict>
                <key>build_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\AutoPkgWin.build</string>
                <key>build_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>build_target</key>
                <string>WIX</string>
                <key>build_property</key>
                <!-- <string><![CDATA[BuildDir=&quot;%BUILD_DIR%\%pkg_dir%\wixproject\AutoPkg&quot;;SourceDir=&quot;%BUILD_DIR%\%pkg_dir%\sourceunzipped\Code&quot;]]></string> -->
                <string>BuildName=%NAME%;BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;AutoPkgDir=%BUILD_DIR%\%pkg_dir%\wixproject\AutoPkg;SourceDir=%BUILD_DIR%\%pkg_dir%\sourceunzipped\Code;SourceNANTDll=%BUILD_DIR%\%pkg_dir%\sourcepkt;version=%build_ver%</string>
            </dict>
        </dict>		
	</array>
</dict>
</plist>
