<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Slack MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.Slack-MSI</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Slack</string>
        <key>SEARCH_URL_MSI</key>
		<!-- https://downloads.slack-edge.com/releases_x64/slack-standalone-4.0.2.0.msi -->
		<!-- <string>(?P&lt;msi_dl_link&gt;https://downloads\.slack-edge.com/releases_x64/slack-standalone-(?P&lt;version&gt;(?P&lt;ver3digit&gt;[0-9]+\.[0-9]+\.[0-9]+)(\.([0-9]+))?)\.msi)</string> -->
		<string>(?P&lt;msi_dl_link&gt;https://downloads\.slack-edge\.com/releases/windows/(?P&lt;ver3digit&gt;[0-9]+\.[0-9]+\.[0-9]+)/prod/x64/slack-standalone-(?P&lt;version&gt;[0-9]+\.[0-9]+\.[0-9]+(\.[0-9]+)?)\.msi)</string>
<!-- 		<key>DOWNLOAD_URL_MSI</key>
		<string>https://downloads.slack-edge.com/releases/windows/%ver3digit%/prod/x64/slack-standalone-%version%.msi</string> -->
		<key>DOWNLOAD_FILE</key>
        <string>Slack</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://slack.com/intl/en-ch/release-notes/windows/rss</string>
                <key>re_pattern</key>
                <string>%SEARCH_URL_MSI%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<!-- <string>%DOWNLOAD_URL_MSI%</string> -->
				<string>https://downloads.slack-edge.com/releases/windows/%ver3digit%/prod/x64/slack-standalone-%version%.msi</string>
                <key>filename</key>
                <string>%NAME%_%PLATFORM%.msi</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <false/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN="Slack Technologies, Inc.", O="Slack Technologies, Inc.", L=San Francisco, S=California, C=US</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>