<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Prusa Slicer Standalone.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.PrusaSlicerStandalone-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PrusaSlicerStandalone</string>
        <key>SEARCH_VER</key>
		<string>(?P&lt;SessionID&gt;ASPSESSIONID[A-Z]+)\t(?P&lt;CookieStr&gt;[A-Z]+)</string>
        <key>DOWNLOAD_URL</key>
		<!-- https://cdn.prusa3d.com/downloads/drivers/PrusaSlicer_Win_standalone_2.4.0.exe#_ga=2.118224842.259939694.1644625206-81207546.1643883079 -->
		<!-- <string>[\w]*-[\w]*-[\w]*-[\w]*-[\w]*</string> -->
		<string>(https://cdn\.prusa3d\.com/downloads/drivers/PrusaSlicer_Win_standalone_(?P&lt;version&gt;([0-9]+\.)*[0-9]+)\.exe)</string>
		<key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:81.0) Gecko/20100101 Firefox/81.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>Process</key>
    <array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>prusa3d/PrusaSlicer</string>
				<key>include_prereleases</key>
				<false/>
				<key>asset_regex</key>
				<string>PrusaSlicer-(?P&lt;finalversion&gt;([0-9]+\.)*[0-9]+)\+win64-[0-9]+\.zip</string>
			</dict>
		</dict>
<!--         <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<string>https://www.prusa3d.com/page/prusaslicer_424/</string>
                <key>re_pattern</key>
                <string>%DOWNLOAD_URL%</string>
				<key>curl_opts</key>
				<array>
					<string>- -request</string>
					<string>GET</string>
				</array>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
			<string>com.github.sebtomasi.SharedProcessors/TextSubstituer</string>
            <key>Arguments</key>
            <dict>
                <key>input_string</key>
                <string>%version%</string>
                <key>pattern_replace</key>
				<array>
                    <dict>
                        <key>pattern</key>
                        <string><![CDATA[ersion_]]></string>
                        <key>repl</key>
                        <string><![CDATA[]]></string>
                    </dict>
                </array>
            </dict>
        </dict>
         <dict>
            <key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <!-- <string>%match%</string> -->
				<string>https://cdn.prusa3d.com/downloads/drivers/PrusaSlicer_Win_standalone_%parsed_string%.exe</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
			    <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN=Prusa Research a.s., OU=Prusa Research, O=Prusa Research a.s., L=Praha, C=CZ, SERIALNUMBER=06649114, OID.1.3.6.1.4.1.311.60.2.1.3=CZ, OID.2.5.4.15=Private Organization</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
