<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for Enpass.</string>
	<key>Identifier</key>
	<string>com.github.autopkg-win.download.Enpass-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Enpass</string>
		<key>URL</key>
        <string>https://www.enpass.io/downloads/</string>
        <key>PLATFORM</key>
        <string>x86</string>
        <key>PF_STRING</key>
        <string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<!-- https://dl.enpass.io/stable/windows/setup/6.6.1.809/Enpass-setup.exe -->
				<string>(?P&lt;url&gt;https:\/\/dl\.enpass\.io\/stable\/windows\/setup\/(?P&lt;version&gt;([0-9]+\.)*[0-9]+)\/Enpass-setup\.exe?)</string>
				<key>url</key>
				<string>%URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN="Enpass Technologies, Inc.", O="Enpass Technologies, Inc.", S=Delaware, C=US</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>