<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current Enpass release.</string>
    <key>Identifier</key>
	<string>com.github.autopkg-win.build.Enpass-Win</string>
    <key>Input</key>
    <dict>
		<key>NAME</key>
		<string>Enpass</string>
		<key>URL</key>
        <string>https://www.enpass.io/downloads/</string>
        <key>PLATFORM</key>
        <string>x86</string>
        <key>PF_STRING</key>
        <string></string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.3.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg-win.download.Enpass-Win</string>

    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
            <string>Create a build enviroment to store the package</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>4</string>
                <key>pkg_dir</key>
                <string>%NAME%_%version%_ML</string>
                <key>folder_list</key>
                <string>release:read</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%NAME%%PF_STRING%_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>run the SafeExamBrowser setup to extract the MSI file to the unzipped dir</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>%DTF_PATH%\..\bin\dark.exe</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>cmdline_args</key>
				<array>
					<string>%pathname%</string>
                    <string>-x</string>
					<string>%BUILD_DIR%\%pkg_dir%\sourceunzipped"</string>
				</array>
<!--                 <key>run_elevated</key>
				<string>true</string> -->
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
			<key>Comment</key>
            <string>Get the full path to the extracted MSI file</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\*\*.msi</string>
            </dict>
        </dict>	
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the Enpass install msi file to the release dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%found_filename%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQL</string>
			<key>Comment</key>
			<string>Set a condition to the desktop shortcut component in the Blender MSI-file</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi</string>
                <key>SQL_command</key>
				<array>
					<string><![CDATA[UPDATE `Component` SET `Component`.`Condition`='DESKTOPSC=1' WHERE `Component`.`Component`='EnpassDesktopShortcut']]></string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
	</array>
</dict>
</plist>
