<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current MiKTeX release to an MSI-package.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.MiKTeX-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MiKTeX</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg-win.download.MiKTeX-Win64</string>

    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
            <string>Create a build enviroment to build the MSI with Wix</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>2</string>
                <key>pkg_dir</key>
                <string>MiKTeX_64_%version%_EN</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject\miktex</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the MiKTeX setup zip archive</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%setup_file%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>preserve_paths</key>
                <string>False</string>
                <key>extract_file</key>
                <string>*</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>run the MiKTeX setup and download the repository to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\miktexsetup.exe</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>cmdline_args</key>
				<array>
					<string>--verbose</string>
                    <string>--local-package-repository=%BUILD_DIR%\%pkg_dir%\sourceunzipped\miktex</string>
					<string>--package-set=complete</string>
 					<string>download</string>
				</array>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the MiKTeX install zip file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%filename%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
		
<!--         <dict>
            <key>Processor</key>
            <string>FileMover</string>
			<key>Comment</key>
            <string>Copy the miktex-texworks.exe file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>C:\APPS\MiKTeX\%version%\miktex\bin\x64\miktex-texworks.exe</string>
                <key>target</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\miktex\miktex-texworks.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>run the MiKTeX setup and install it to C:\APPS</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\miktexsetup.exe</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>cmdline_args</key>
				<array>
                    <string>--local-package-repository=%BUILD_DIR%\%pkg_dir%\sourceunzipped\miktex</string>
					<string>--package-set=complete</string>
					<string>--shared=yes</string>
					<string>--common-install=C:\APPS\MiKTeX\%version%</string>
					<string>--common-config=C:\APPS\MiKTeX\config</string>
					<string>--common-data=C:\APPS\MiKTeX\data</string>
					<string>--user-install=C:\APPS\MiKTeX\%version%</string>
 					<string>install</string>
				</array>
                <key>run_elevated</key>
				<string>true</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the miktex-texworks.exe file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>C:\APPS\MiKTeX\%version%\miktex\bin\x64\miktex-texworks.exe</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\miktex\miktex-texworks.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the miktex-console.exe file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>C:\APPS\MiKTeX\%version%\miktex\bin\x64\miktex-console.exe</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\miktex\miktex-console.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the miktex-console.exe file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>C:\APPS\MiKTeX\%version%\miktex\bin\x64\mpm.exe</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\miktex\mpm.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>Compress the MiKTeX folder with 7zip to a self extracting archive</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>%SZIP_PATH%</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>cmdline_args</key>
				<array>
					<string>a</string>
					<string>-r</string>
					<string>-sfx</string>
					<string>-t7z</string>
					<string>-v1900m</string>
					<string>-mx9</string>
                    <string>%BUILD_DIR%\%pkg_dir%\release\miktex29.exe</string>
					<string>c:\APPS\MiKTeX\*.*</string>
				</array>
			</dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-MiKTeX_64_%build_ver%_EN.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-MiKTeX_64_%build_ver%_EN.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
			<key>Comment</key>
            <string>Set the actual version strings to the version.wxi file</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%build_ver%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSBuildRun</string>
			<key>Comment</key>
            <string>Run the MSBuild script to generate the MiKTeX MSI installer</string>
            <key>Arguments</key>
            <dict>
                <key>build_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\MiKTeX.build</string>
                <key>build_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>build_target</key>
                <string>WIX</string>
                <key>build_property</key>
                <string>BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;MiKTeXDir=%BUILD_DIR%\%pkg_dir%\wixproject\MiKTeX;version=%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>run the MiKTeX setup and uninstall from C:\APPS</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>C:\APPS\MiKTeX\%version%\miktex\bin\x64\miktexsetup.exe</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>cmdline_args</key>
				<array>
                    <string>--local-package-repository=%BUILD_DIR%\%pkg_dir%\sourceunzipped\miktex</string>
					<string>--package-set=complete</string>
					<string>--shared=yes</string>
					<string>--common-install=C:\APPS\MiKTeX\%version%</string>
					<string>--common-config=C:\APPS\MiKTeX\config</string>
					<string>--common-data=C:\APPS\MiKTeX\data</string>
					<string>--user-install=C:\APPS\MiKTeX\%version%</string>
 					<string>uninstall</string>
				</array>
                <key>run_elevated</key>
				<string>true</string>
			</dict>
        </dict>
	</array>
</dict>
</plist>
