<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current TexStudio x64 release to an MSI-package.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.TexStudio-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TexStudio</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>PF_STRING</key>
        <string>_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg-win.download.TexStudio-Win64</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
            <string>Create a build enviroment to build the MSI with Wix</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>pkg_dir</key>
				<string>%NAME%%PF_STRING%_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject:wixproject\texstudio:wixproject\Includes:wixproject\Resources:wixproject\Lang</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%NAME%%PF_STRING%_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the TexStudio installer file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%filename%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
			<string>run the TexStudio setup and install to the programm</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>cmdline_args</key>
				<array>
					<string>/S</string>
                    <string>/D=%BUILD_DIR%\%pkg_dir%\sourceunzipped</string>
				</array>
                <key>run_elevated</key>
				<true/>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the TexStudio installer file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\TexStudio\</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
			<key>Comment</key>
            <string>Set the actual version strings to the version.wxi file</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%build_ver%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSBuildRun</string>
			<key>Comment</key>
            <string>Run the MSBuild script to generate the TexStudio MSI installer</string>
            <key>Arguments</key>
            <dict>
                <key>build_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\TexStudio.build</string>
                <key>build_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>build_target</key>
                <string>WIX</string>
                <key>build_property</key>
                <string>BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;TexStudioDir=%BUILD_DIR%\%pkg_dir%\wixproject\TexStudio;version=%version%</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>run the TexStudio setup and uninstall to the programm</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\uninstall.exe</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped</string>
                <key>cmdline_args</key>
				<array>
					<string>/S</string>
                    <string>_?=%BUILD_DIR%\%pkg_dir%\sourceunzipped</string>
				</array>
			</dict>
            <key>run_elevated</key>
			<true/>
        </dict>
		<!-- Todo: Why does this processor throw an error? -->
		<!--	<dict>
            <key>Processor</key>
            <string>PathDeleter</string>
			<key>Comment</key>
			<string>Delete the temp file in the release folder</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
				<array>
                    <string>%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.wixpdb</string>
				</array>
			</dict>
		</dict> -->
	</array>
</dict>
</plist>
