<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for VMware Workstation</string>
	<key>Identifier</key>
	<string>com.github.autopkg-win.download.VMwareWS-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>Vmware-Workstation</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.4.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>VMwareWSURLProvider</string>
			<key>Arguments</key>
			<dict>
				<key>product_name</key>
				<string>ws-windows.xml</string>
				<key>major_version</key>
				<string>latest</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.exe</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
