<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for WinSCP.</string>
	<key>Identifier</key>
	<string>com.github.autopkg-win.download.WinSCP-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>WinSCP</string>
		<key>URL</key>
        <string>https://winscp.net/eng/download.php</string>
		 <key>SF_DL_SRV</key>
        <string>netix</string>
        <key>PLATFORM</key>
        <string>x86</string>
        <key>PF_STRING</key>
        <string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<!-- https://winscp.net/download/WinSCP-5.19.1-Setup.exe -->
				<string>(?P&lt;filetosearch&gt;WinSCP-(?P&lt;version&gt;([0-9]+\.)*[0-9]+)-Setup\.exe?)</string>
				<key>url</key>
				<string>%URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>url</key>
				<!-- <string>https://winscp.net/download/%filetosearch%</string> -->
				<string>https://%SF_DL_SRV%.dl.sourceforge.net/project/winscp/WinSCP/%version%/WinSCP-%version%-Setup.exe</string>
				<key>filename</key>
				<string>%NAME%.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN=Martin Prikryl, O=Martin Prikryl, L=Prague, C=CZ, SERIALNUMBER=87331519, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.3=CZ</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>