<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for OBS-Studio x64.</string>
	<key>Identifier</key>
	<string>com.github.autopkg-win.download.OBS-Studio-Win64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OBS-Studio</string>
		<key>URL</key>
        <string>https://obsproject.com</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>PF_STRING</key>
        <string>_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>obsproject/obs-studio</string>
				<key>asset_regex</key>
				<!-- https://github.com/obsproject/obs-studio/releases/download/27.2.3/OBS-Studio-27.2.3-Full-Installer-x64.exe -->
				<string>OBS-Studio-([0-9]+\.)*[0-9]+-Full-Installer-x64\.exe</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
			    <key>filename</key>
                <string>%NAME%-x64.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN=Hugh Bailey, O=Hugh Bailey, L=Temecula, S=California, C=US</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>