<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest version of the JabRef MSI-Installer from GitHub.</string>
    <key>Identifier</key>
	<string>com.github.autopkg-win.download.Jabref-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Jabref</string>
        <key>PLATFORM</key>
        <string>x86</string>
        <key>PF_DIGIT</key>
        <string></string>
        <key>SEARCH_URL</key>
        <string>https://inkscape.org</string>
        <key>SEARCH_PATTERN1</key>
		<string>(/release/(?P&lt;version&gt;[0-9]{1,3}.[0-9]{0,3}.[0-9]{0,3})/windows/)</string>
        <key>SEARCH_PATTERN2</key>
		<!-- https://inkscape.org/gallery/item/21592/inkscape-1.0.1-x64.msi -->
        <string>(?P&lt;fullurl&gt;\/gallery\/.*\/inkscape-.*-x[\d]*\.msi)</string>    
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
<!--         <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%/release</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN1%</string>
                <key>result_output_var_name</key>
                <string>release_page_match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%%release_page_match%%PF_DIGIT%-bit/msi/dl/</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN2%</string>
                <key>result_output_var_name</key>
                <string>gallery_download_match</string>
            </dict>
        </dict> -->
		<dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>JabRef/jabref</string>
				<key>asset_regex</key>
				<string>JabRef-[\S]+\.msi</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <!-- <string>%SEARCH_URL%%gallery_download_match%</string> -->
				<string>%url%</string>
                <key>filename</key>
                <string>%NAME%.msi</string>
            </dict>
        </dict>
<!--         <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>Populate to use</string>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
