<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds latest Firefox x64 to an MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.Firefox-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Firefox_64</string>
        <key>SEARCH_URL</key>
        <string><![CDATA[https://download.mozilla.org/?product=firefox-latest&amp;os=win64&amp;lang=en-US]]></string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.mozilla.org/?product=firefox-latest&amp;os=win&amp;lang=en-US</string>
        <key>PLATFORM_STR</key>
        <string>x64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.Firefox-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
    <!--    -->
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
	<!--
	-->
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>pkg_dir</key>
                <string>Firefox_64_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
                <key>recipe_cache_dir</key>
                <string>%RECIPE_CACHE_DIR%</string>
                <key>PrevVerFiles</key>
                <string>PrevVerFiles.txt</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>%build_ver%</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%\version.txt</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>Firefox_64_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>prop_file</key>
                <string>wixproject\global.prop</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-FireFox_64_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-Firefox_64_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MozillaAddonIntegrator</string>
			<key>Comment</key>
			<string>Integrate Addons into the install. Enable Sideloading in omni.ja</string>
            <key>Arguments</key>
            <dict>
			application_name
				<key>application_name</key>
                <string>Mozilla Firefox</string>
                <key>install_exe</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe</string>
                <key>new_extensions</key>
				<array>
					<string>de.xpi|||https://ftp.mozilla.org/pub/firefox/releases/%version%/win64/xpi/de.xpi|||ExtlpDEFiles</string>
					<string>fr.xpi|||https://ftp.mozilla.org/pub/firefox/releases/%version%/win64/xpi/fr.xpi|||ExtlpFRFiles</string>
					<string>it.xpi|||https://ftp.mozilla.org/pub/firefox/releases/%version%/win64/xpi/it.xpi|||ExtlpITFiles</string>
					<string>rm.xpi|||https://ftp.mozilla.org/pub/firefox/releases/%version%/win64/xpi/rm.xpi|||ExtlpRMFiles</string>
					<string>dict-de.xpi|||https://addons.mozilla.org/firefox/downloads/latest/german-dictionary-de_ch-for-sp/|||ExtdicDEFiles</string>
					<string>dict-fr.xpi|||https://addons.mozilla.org/firefox/downloads/file/3581786/|||ExtdicFRFiles</string>
					<string>dict-it.xpi|||https://addons.mozilla.org/firefox/downloads/latest/dizionario-italiano/|||ExtdicITFiles</string>
					<string>noscript.xpi|||https://addons.mozilla.org/firefox/downloads/latest/noscript/|||ExtNoscriptFiles</string>
					<string>adblock.xpi|||https://addons.mozilla.org/firefox/downloads/latest/adblock-plus/|||ExtAdblockFiles</string>
				</array>
                <key>omni_path</key>
				<string>omni.ja</string>
                <key>config_file_path</key>
				<string>modules\AppConstants.jsm</string>
                <key>temp_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\adm</string>
                <key>ext_install_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\wixproject\Mozilla Firefox\browser\extensions</string>
                <key>app_build_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>ext_install_xslt</key>
				<string>%BUILD_DIR%\%pkg_dir%\wixproject\GUID-Preserve-x64.xslt</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>run_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/NANTrun</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>