<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds latest Firefox x86 to an MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.Firefox-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Firefox</string>
        <key>SEARCH_URL</key>
        <string><![CDATA[https://download.mozilla.org/?product=firefox-latest&amp;os=win&amp;lang=en-US]]></string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.mozilla.org/?product=firefox-latest&amp;os=win&amp;lang=en-US</string>
        <key>PLATFORM_STR</key>
        <string>x86</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.Firefox-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
    <!--    -->
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
	<!--
	-->
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>pkg_dir</key>
                <string>Firefox_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
                <key>recipe_cache_dir</key>
                <string>%RECIPE_CACHE_DIR%</string>
                <key>PrevVerFiles</key>
                <string>PrevVerFiles.txt</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>%build_ver%</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%\version.txt</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>Firefox_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>prop_file</key>
                <string>wixproject\global.prop</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-FireFox_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-Firefox_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MozillaOmniUpdate</string>
			<key>Comment</key>
			<string>Update the omni.ja file in Mozilla products to allow certain extensions as features</string>
            <key>Arguments</key>
            <dict>
                <key>install_exe</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe</string>
                <key>new_features</key>
				<array>
					<string>langpack-de@firefox.mozilla.org</string>
					<string>langpack-fr@firefox.mozilla.org</string>
					<string>langpack-it@firefox.mozilla.org</string>
					<string>langpack-rm@firefox.mozilla.org</string>
					<string>de_CH@dicts.j3e.de</string>
					<string>fr-dicollecte@dictionaries.addons.mozilla.org</string>
					<string>it-IT@dictionaries.addons.mozilla.org</string>
					<string>{73a6fe31-595d-460b-a920-fcc0f8843232}</string>
					<string>{d10d0bf8-f5b5-c8b4-a8b2-2b9879e08c5d}</string>
				</array>
                <key>temp_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\adm</string>
                <key>output_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
            </dict>
		</dict>
        <dict>								
            <key>Arguments</key>
            <dict>
                <key>run_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/NANTrun</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>