<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Thunderbird (x86/x64) offline installer for Windows.</string>
    <key>Identifier</key>
    <string>ch.ethz.gitlab.id-cd-win.download.Thunderbird-Win</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>filename</key>
                <string>%NAME%-Setup-%PLATFORM_STR%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>Thunderbird%20Setup%20(([0-9]+\.)*[0-9]+)</string>
                <!-- <string>&lt;update version=&quot;(?P&lt;match&gt;(?P&lt;ver_major&gt;[0-9]+),0,0,(?P&lt;ver_minor&gt;[0-9]+), $1\.0\.0\.$2)&quot;&gt;</string>  -->
                <key>curl_opts</key>
                    <array>
                       <string>-I</string>
                    </array>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%match%</string>
                <key>rename_var</key>
                <string>version</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN=Mozilla Corporation, O=Mozilla Corporation, L=Mountain View, S=California, C=US</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\version.txt</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%\prev_version.txt</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>%version%</string>
                <key>file_path</key>
                <string>%RECIPE_CACHE_DIR%\version.txt</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>