<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Builds latest Thunderbird x64 to an MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>ch.ethz.gitlab.id-cd-win.build.Thunderbird-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Thunderbird_64</string>
        <key>SEARCH_URL</key>
        <string><![CDATA[https://download.mozilla.org/?product=thunderbird-latest&amp;os=win64&amp;lang=en-US]]></string>
        <key>DOWNLOAD_URL</key>
        <string>https://download.mozilla.org/?product=thunderbird-latest&amp;os=win64&amp;lang=en-US</string>
        <key>PLATFORM_STR</key>
        <string>x64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>ch.ethz.gitlab.id-cd-win.download.Thunderbird-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
	<!--
	-->
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>pkg_dir</key>
                <string>Thunderbird_64_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
                <key>recipe_cache_dir</key>
                <string>%RECIPE_CACHE_DIR%</string>
                <key>PrevVerFiles</key>
                <string>PrevVerFiles.txt</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>Thunderbird_64_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/WixDefaults</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%version%</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-Thunderbird_64.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-Thunderbird_64.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%-Setup-%PLATFORM_STR%.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>run_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
            </dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/NANTrun</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>