<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Google Sync x64 MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.NickETH.download.GoogleSyncMSI-Win64</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                    <!-- <string>%DOWNLOAD_URL%</string> -->
                <string>https://dl.google.com/drive/gsync_enterprise64.msi</string>				
                <key>filename</key>
                <string>GoogleSyncEnterprise64.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/MSIRunSQLget</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%CACHE_DIR%\com.github.NickETH.download.GoogleSyncMSI-Win64\downloads\GoogleSyncEnterprise64.msi</string>
                <key>SQL_command</key>
                <string><![CDATA[SELECT `Value` FROM `Property` WHERE `Property`.`Property`='ProductVersion']]></string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%msi_value%</string>
                <key>rename_var</key>
                <string>version</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>%version%</string>
                <key>file_path</key>
                <string>%CACHE_DIR%\com.github.NickETH.download.GoogleSyncMSI-Win64\version.txt</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>