<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Google Chrome x86/x64 MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.GoogleChromeMSI-Win</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <!-- <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string> -->
				<string>(?P&lt;version&gt;(?P&lt;ver_major&gt;[0-9]+)\.(?P&lt;ver_majorminor&gt;[0-9]+)\.(?P&lt;ver_minor&gt;[0-9]+)\.(?P&lt;build&gt;[0-9]+))</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileCreator</string>
            <key>Arguments</key>
            <dict>
                <key>file_content</key>
                <string>%match%</string>
                <key>file_path</key>
                <string>%CACHE_DIR%\com.github.autopkg-win.build.GoogleChrome-%PLATFORM%\version.txt</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%ver_major%.%ver_minor%.%build%</string>
                <key>rename_var</key>
                <string>msiversion</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>GoogleChromeEnterprise-%DOWNLOAD_FILE%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>