<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Alters latest Google Chrome x86 MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.NickETH.build.GoogleChrome-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleChromeX86</string>
        <key>SEARCH_URL</key>
        <string>http://omahaproxy.appspot.com/win</string>
        <key>DOWNLOAD_URL</key>
        <string>https://dl.google.com/dl/chrome/install/googlechromestandaloneenterprise.msi</string>
        <key>DOWNLOAD_FILE</key>
        <string>x86.msi</string>
        <key>PLATFORM</key>
        <string>Win</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.NickETH.download.GoogleChromeMSI-Win</string>
    <key>Process</key>
    <array>
	<!--
	-->
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
	<!--
	-->
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>pkg_dir</key>
                <string>GoogleChrome_%version%_ML</string>
                <key>folder_list</key>
                <string>sourceunzipped:release:read:helpers</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-GoogleChrome.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-GoogleChrome.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\GoogleChromeEnterprise-x86.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_%version%_ML.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/MSIRunSQL</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_%version%_ML.msi</string>
                <key>SQL_command</key>
                <string><![CDATA[UPDATE `Property` SET `Property`.`Value`='%match%' WHERE `Property`.`Property`='ProductVersion']]></string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/MSIApplyTransform</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_%version%_ML.msi</string>
                <key>mst_paths</key>
                <string>%BUILD_DIR%\%pkg_dir%\helpers\GChrome_ETHZchanges.mst</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.NickETH.SharedProcessors/MSIApplySumInfo</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_%version%_ML.msi</string>
                <key>cmnds_sinfo</key>			
				<dict>
				    <key>/o</key>
                    <string>Slightley altered version for mass deployment.</string>
				    <key>/j</key>
                    <string>Google Chrome x86 %match% ML</string>
				    <key>/t</key>
                    <string>Google Chrome x86 %match% ML</string>
				</dict>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>