<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Alters latest Google Chrome x64 MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.GoogleChrome-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>GoogleChromeX64</string>
        <key>SEARCH_URL</key>
        <string>http://omahaproxy.appspot.com/win</string>
        <key>DOWNLOAD_URL</key>
        <string>https://dl.google.com/dl/chrome/install/googlechromestandaloneenterprise64.msi</string>
        <key>DOWNLOAD_FILE</key>
        <string>x64.msi</string>
        <key>PLATFORM</key>
        <string>Win64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.GoogleChromeMSI-Win</string>
    <key>Process</key>
    <array>
	<!--
	-->
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>pkg_dir</key>
                <string>GoogleChrome_64_%version%_ML</string>
                <key>folder_list</key>
                <string>sourceunzipped:release:read:helpers</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-GoogleChrome_64_%version%_ML.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-GoogleChrome_64_%version%_ML.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\GoogleChromeEnterprise-x64.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_64_%version%_ML.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSITransformer</string>
			<key>Comment</key>
			<string>Applies the Settings-Transform to the GoogleChrome.msi in the release folder</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_64_%version%_ML.msi</string>
                <key>mst_paths</key>
                <string>%BUILD_DIR%\%pkg_dir%\helpers\GChrome64_ETHZchanges.mst</string>
                <key>mode</key>
                <string>-a</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQLget</string>
			<key>Comment</key>
			<string>get the ProductCode GUID from the MSI</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_64_%version%_ML.msi</string>
                <key>SQL_command</key>
                <string><![CDATA[SELECT `Value` FROM `Property` WHERE `Property`='ProductCode']]></string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ChromiumSettings</string>
			<key>Comment</key>
			<string>Generate the settings JSON and encode it</string>
            <key>Arguments</key>
            <dict>
                <key>product_GUID</key>
    	        <string>%msi_value%</string>
                <key>new_settings</key>
                <dict>
    	            <key>homepage</key>
        	        <string>http://www.ethz.ch</string>
            	    <key>homepage_is_newtabpage</key>
					<false/>
	                <key>session.restore_on_startup</key>
    	            <integer>1</integer>
					<key>first_run_tabs</key>
				    <array>
						<string>chrome://newtab</string>
					</array>
	                <key>browser</key>
				    <dict>
						<key>check_default_browser</key>
						<false/>
						<key>show_home_button</key>
						<true/>
					</dict>
	                <key>bookmark_bar</key>
				    <dict>
						<key>show_on_all_tabs</key>
						<true/>
					</dict>
        	        <key>sync_promo</key>
				    <dict>
						<key>show_on_first_run_allowed</key>
						<false/>
					</dict>
    	            <key>distribution</key>
				    <dict>
						<key>msi</key>
						<true/>
						<key>allow_downgrade</key>
						<string>[AllowDowngradeSubstitution]</string>
						<key>create_all_shortcuts</key>
						<false/>
						<key>do_not_create_desktop_shortcut</key>
						<true/>
						<key>do_not_create_quick_launch_shortcut</key>
						<true/>
						<key>do_not_create_taskbar_shortcut</key>
						<true/>
						<key>do_not_launch_chrome</key>
						<true/>
						<key>do_not_register_for_update_launch</key>
						<true/>
						<key>import_bookmarks</key>
						<false/>
						<key>import_history</key>
						<false/>
						<key>import_home_page</key>
						<false/>
						<key>import_search_engine</key>
						<false/>
						<key>make_chrome_default</key>
						<false/>
						<key>make_chrome_default_for_user</key>
						<false/>
						<key>require_eula</key>
						<false/>
						<key>show_welcome_page</key>
						<false/>
						<key>skip_first_run_ui</key>
						<true/>
						<key>suppress_first_run_bubble</key>
						<true/>
						<key>suppress_first_run_default_browser_prompt</key>
						<true/>
						<key>system_level</key>
						<true/>
						<key>verbose_logging</key>
						<true/>
					</dict>
				</dict>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQL</string>
			<key>Comment</key>
			<string>Set the correct version / Harden the uninstall command / set the install options</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_64_%version%_ML.msi</string>
                <key>SQL_command</key>
				<array>
					<string><![CDATA[UPDATE `Property` SET `Property`.`Value`='%msiversion%' WHERE `Property`.`Property`='ProductVersion']]></string>
					<string><![CDATA[UPDATE `Property` SET `Property`.`Value`='%chrm_settings_url%' WHERE `Property`.`Property`='MASTER_PREFERENCES']]></string>
					<string><![CDATA[UPDATE `InstallExecuteSequence` SET `InstallExecuteSequence`.`Condition`='((?ProductClientState=3) AND ($ProductClientState=2) AND NOT UPGRADINGPRODUCTCODE) AND UNINSTALLCMDLINE AND UNINSTALLCMDARGS' WHERE `InstallExecuteSequence`.`Action`='CallUninstaller']]></string>
					<string><![CDATA[DELETE FROM `Upgrade` WHERE `Upgrade`.`ActionProperty`='UPGRADEFOUND']]></string>
					<string><![CDATA[DELETE FROM `Upgrade` WHERE `Upgrade`.`ActionProperty`='NEWPRODUCTFOUND']]></string>
					<string><![CDATA[INSERT INTO `Upgrade` (`Upgrade`.`UpgradeCode`,`Upgrade`.`VersionMin`,`Upgrade`.`VersionMax`,`Upgrade`.`Attributes`, `Upgrade`.`ActionProperty`) VALUES ('{C1DFDF69-5945-32F2-A35E-EE94C99C7CF4}','0.0.0','%msiversion%',768,'UPGRADEFOUND')]]></string>
					<string><![CDATA[INSERT INTO `Upgrade` (`Upgrade`.`UpgradeCode`,`Upgrade`.`VersionMin`,`Upgrade`.`VersionMax`,`Upgrade`.`Attributes`, `Upgrade`.`ActionProperty`) VALUES ('{C1DFDF69-5945-32F2-A35E-EE94C99C7CF4}','%msiversion%','',0,'NEWPRODUCTFOUND')]]></string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIApplySumInfo</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\GoogleChrome_64_%version%_ML.msi</string>
                <key>cmnds_sinfo</key>			
				<dict>
				    <key>/o</key>
                    <string>Version %build_ver% for ETHZ ID. %us_date% by AutoPkg</string>
				    <key>/j</key>
                    <string>Google Chrome x64 %build_ver% ML</string>
				    <key>/t</key>
                    <string>Google Chrome x64 %build_ver% ML</string>
				</dict>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>