<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download recipe for Python x64.</string>
	<key>Identifier</key>
	<string>com.github.autopkg-win.download.Python-Win64</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Python</string>
		<key>URL</key>
        <string>https://www.python.org/downloads/windows/</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>PF_STRING</key>
        <string>_64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.3.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<!-- https://www.python.org/ftp/python/3.10.4/python-3.10.4-amd64.exe -->
				<string>(https://www.python.org/.*python-(?P&lt;version&gt;([0-9]+\.)*[0-9]+)-amd64\.exe?)</string>
				<key>url</key>
				<string>%URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
        <dict>
            <key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
				<key>url</key>
				<string>%match%</string>
			    <key>filename</key>
                <string>%NAME%-x64.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN=Python Software Foundation, O=Python Software Foundation, L=Beaverton, S=Oregon, C=US</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>