<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current FileZilla x64 release to an MSI-package.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.FileZilla-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileZilla</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>PF_STRING</key>
        <string>_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg-win.download.FileZilla-Win64</string>
    <key>Process</key>
    <array>
<!--         <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
            <string>Create a build enviroment to build the MSI with Wix</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>pkg_dir</key>
				<string>%NAME%%PF_STRING%_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject:wixproject\%NAME%:wixproject\Includes:wixproject\Resources:wixproject\Lang:wixproject\Fragments</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%NAME%%PF_STRING%_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the FileZilla installer file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%filename%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the autopkg zip archive</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%</string>
                <key>preserve_paths</key>
                <string>True</string>
                <key>extract_file</key>
                <string>*</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
<!--         <dict>
            <key>Processor</key>
            <string>FileMover</string>
			<key>Comment</key>
            <string>Rename the $R0 file to fzshellext.dll</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\$R0</string>
                <key>target</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\fzshellext.dll</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
			<key>Comment</key>
            <string>Rename the $R0 file to fzshellext_64.dll</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\$R0</string>
                <key>target</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\fzshellext_64.dll</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
			<key>Comment</key>
            <string>Delete unnesessary folders from the FileZilla installer files</string>
            <key>Arguments</key>
            <dict>
                <key>path_list</key>
				<array>
                    <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\$PLUGINSDIR</string>
					<string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\$R2</string>
				</array>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
			<key>Comment</key>
            <string>Set the actual version strings to the version.wxi file</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%build_ver%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSBuildRun</string>
			<key>Comment</key>
            <string>Run the MSBuild script to generate the FileZilla MSI installer</string>
            <key>Arguments</key>
            <dict>
                <key>build_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%.build</string>
                <key>build_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>build_target</key>
                <string>WIX</string>
                <key>build_property</key>
				<string>BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;SourceDir=%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%;version=%build_ver%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>clean up the R folder from C:\APPS</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>FileHash.cmd</string>
                <key>exe_folder</key>
                <string>C:\APPS</string>
                <key>cmdline_args</key>
				<array>
                    <string>%TOOLS_DIR%</string>
					<string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%</string>
				</array>
                <key>run_elevated</key>
				<string>false</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
	</array>
</dict>
</plist>
