<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Patches Adobe Reader DC for Windows (MSI) with the latest Update MSP-file and builds it.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.AdobeReaderDC-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeReaderDC</string>
        <key>SEARCH_URL</key>
        <string>https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html</string>
    <!-- 
        <key>DOWNLOAD_URL</key>
        <string>ftp://ftp.adobe.com/pub/adobe/reader/win/AcrobatDC/%version_string%/AcroRdrDCUpd%version_string%.msp</string>
	-->
        <key>DOWNLOAD_FILE</key>
        <string>active_x.msi</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.AdobeReaderDCMSI-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>


                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>pkg_dir</key>
                <string>AdobeReaderDC_%version%_deu</string>
                <key>folder_list</key>
                <string>sourceunzipped:release:read:helpers</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-AdobeReaderDC_%version%_deu.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-AdobeReaderDC_%version%_deu.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
    <!--
	-->
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\AdobeReaderDCUpd%version_string%.msp</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>

        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIofflinePatcher</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_dir_abs</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>msi_path</key>
                <string>sourceunzipped\AcroRdrDC1500720033_de_DE.msi</string>
                <key>msp_path</key>
                <string>sourceunzipped\AdobeReaderDCUpd%version_string%.msp</string>
                <key>adm_msi_path</key>
                <string>adm\AcroRdrDC1500720033_de_DE.msi</string>
                <key>new_msi_path</key>
                <string>adm\AcroRdrDC%version_string%_de_DE.msi</string>
                <key>cab_file</key>
                <string>Data1</string>
                <key>embed_cab</key>
                <string>True</string>
                <key>new_packcode</key>
                <string>True</string>
            </dict>
		</dict>

        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/AcrobatGUIDPatcher</string>
            <key>Arguments</key>
            <dict>
                <key>base_GUID</key>
                <string>{AC76BA86-7AD7-1031-7B44-AC0F074E4100}</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>old_hex_ver</key>
                <string>0F074E41</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQL</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\adm\AcroRdrDC%version_string%_de_DE.msi</string>
                <key>SQL_command</key>
				<array>
                    <string><![CDATA[UPDATE `Property` SET `Property`.`Value`='%newGUID%' WHERE `Property`.`Property`='ProductCode']]></string>
                    <string><![CDATA[UPDATE `Property` SET `Property`.`Value`='Adobe Acrobat Reader DC DE-EN' WHERE `Property`.`Property`='ProductName']]></string>
                    <string><![CDATA[UPDATE `Component` SET `Component`.`Condition`='CHROMEPLUGIN' WHERE `Component`.`Component`='WCChromeNativeMessagingHost']]></string>
                    <string><![CDATA[UPDATE `MoveFile` SET `MoveFile`.`SourceName`='AdobeReaderDC_%version%_Deu.msi', `MoveFile`.`DestName`='AdobeReaderDC_%version%_Deu.msi' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_AcroRdrDC1501720050_de_DE.msi']]></string>
				</array>
			</dict>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\adm\AcroRdrDC%version_string%_de_DE.msi</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSITransformer</string>
			<key>Comment</key>
			<string>Applies the Settings-Transform to the AdobeReaderDC.msi in the release folder</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi</string>
                <key>mst_paths</key>
				<array>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\CurrentUser1.mst</string>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\ActiveSetup1.mst</string>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\ActiveSetup64.mst</string>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\DisJavaScript.mst</string>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\EnableSysCert.mst</string>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\DisExeLaunch.mst</string>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\MUI.mst</string>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\AcroRdrDC15UI1.mst</string>
                </array>
                <key>mode</key>
                <string>-a</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQL</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi</string>				
                <key>SQL_command</key>
				<array>
                    <string><![CDATA[UPDATE `Registry` SET `Registry`.`Value`='%ASver%' WHERE `Registry`.`Registry`='RegHKLM2']]></string>
                    <string><![CDATA[UPDATE `Registry` SET `Registry`.`Value`='%ASver%' WHERE `Registry`.`Registry`='Reg64HKLM2']]></string>
                    <string><![CDATA[UPDATE `MoveFile` SET `MoveFile`.`SourceName`='AdobeReaderDC_%version%_Deu.msi', `MoveFile`.`DestName`='AdobeReaderDC_%version%_Deu.msi' WHERE `MoveFile`.`FileKey`='CacheSetupFiles_AcroRdrDC1501720050_de_DE.msi']]></string>
				</array>
			</dict>
		</dict>
		<!--    -->
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIApplySumInfo</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\AdobeReaderDC_%version%_Deu.msi</string>				
                <key>cmnds_sinfo</key>			
				<dict>
				    <key>/o</key>
                    <string>Slightely altered version for ETHZ ID. %us_date% by AutoPkg</string>
				    <key>/j</key>
                    <string>Adobe Reader DC %version%</string>
				    <key>/t</key>
                    <string>Adobe Reader DC %version%</string>
				</dict>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>