<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Adobe AIR installer for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.AdobeAIR-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeAIR</string>
        <key>DOWNLOAD_URL</key>
		<!-- https://airsdk.harman.com/runtime -->
		<string>https://airsdk.harman.com/assets/downloads/AdobeAIR.exe</string>
        <!-- <string>https://airdownload.adobe.com/air/win/download/latest/AdobeAIRInstaller.exe</string> -->
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko</string>
        <key>SEARCH_URL</key>
        <string>https://airsdk.harman.com/runtime</string>
        <key>SEARCH_PATTERN</key>
		<!-- <div _ngcontent-oyb-c6="" class="miniTitle">AIR runtime - version 33.1.1.444</div> -->
        <!-- <string>(https.*FileZilla.*_win64.*(?P&lt;version&gt;([0-9]+\.)*[0-9]+))"</string> -->
		<!-- <string>"miniTitle"&gt;AIR runtime - version (?P&lt;version&gt;([0-9]+\.)*[0-9]+)&lt;/div&gt;</string> -->
		<string>AIR runtime - version (?P&lt;version&gt;([0-9]+\.)*[0-9]+)</string>
		<!-- <string>(https.*client/FileZilla_(?P&lt;version&gt;([0-9]+\.)*[0-9]+)_win64-setup.exe.*)"\srel="nofollow"</string> -->
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
<!-- 		<dict>
			<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict> -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
				<string>CN="Harman International Industries, Incorporated", OU=Information Technology, O="Harman International Industries, Incorporated", L=Stamford, S=Connecticut, C=US, SERIALNUMBER=886255, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US</string>
            </dict>
        </dict>		
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
