<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Adobe Reader DC Update MSP-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.AdobeReaderDCMSI-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeReaderDC</string>
        <key>SEARCH_URL</key>
        <string>https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/index.html</string>
		<key>SEARCH_PATTERN</key>
		<string>/AcroRdrDCUpd(?P&lt;version_string&gt;(?P&lt;ver_major&gt;[0-9]{2})(?P&lt;ver_majorminor&gt;[0-9]{3})(?P&lt;ver_minor&gt;[0-9]{5}))\.msp</string>
        <key>DOWNLOAD_FILE</key>
        <string>AdobeReaderDCUpd.msp</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
			<key>Comment</key>
			<string>Get the most recent release notes page</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
				<string>continuous/.*\.html</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
			<key>Comment</key>
			<string>Read out link and version from the release notes page</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.adobe.com/devnet-docs/acrobatetk/tools/ReleaseNotesDC/%match%</string>
                <key>re_pattern</key>
                <!-- <string>%SEARCH_PATTERN%</string> -->
				<string>/AcroRdrDCUpd(?P&lt;version_string&gt;(?P&lt;ver_major&gt;[0-9]{2})(?P&lt;ver_majorminor&gt;[0-9]{3})(?P&lt;ver_minor&gt;[0-9]{5}))\.msp</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%ver_major%.%ver_majorminor%.%ver_minor%</string>
                <key>rename_var</key>
                <string>version</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%ver_major%,%ver_majorminor%,%ver_minor%</string>
                <key>rename_var</key>
                <string>ASver</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<string>https://ardownload2.adobe.com/pub/adobe/reader/win/AcrobatDC/%version_string%/AcroRdrDCUpd%version_string%.msp</string>
                <key>filename</key>
                <string>%DOWNLOAD_FILE%</string>
                <key>CHECK_FILESIZE_ONLY</key>
                <string>False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN=Adobe Inc., OU=Acrobat DC, O=Adobe Inc., L=San Jose, S=ca, C=US, SERIALNUMBER=2748129, OID.2.5.4.15=Private Organization, OID.1.3.6.1.4.1.311.60.2.1.2=Delaware, OID.1.3.6.1.4.1.311.60.2.1.3=US</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>