<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Packages the latest Adobe AIR client for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.AdobeAIR-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeAIR</string>
        <key>DOWNLOAD_URL</key>
        <string>https://airdownload.adobe.com/air/win/download/latest/AdobeAIRInstaller.exe</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.AdobeAIR-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>%RECIPE_CACHE_DIR%\downloads\</string>
                <key>extract_file</key>
                <string>setup.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQLget</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\setup.msi</string>
                <key>SQL_command</key>
                <string><![CDATA[SELECT `Value` FROM `Property` WHERE `Property`='ProductVersion']]></string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>ch.ethz.gitlab.id-cd-win.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%msi_value%</string>
                <key>rename_var</key>
                <string>version</string>
            </dict>
		</dict>		
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>pkg_dir</key>
                <string>Adobe_AIR_%version%_ENU</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\AdobeAIR_%version%.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped</string>
                <key>extract_file</key>
                <string>*</string>				
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIofflinePatcher</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_dir_abs</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>msi_path</key>
                <string>sourceunzipped\setup.msi</string>
                <key>adm_msi_path</key>
                <string>adm\setup.msi</string>
                <key>new_msi_path</key>
                <string>adm\Adobe_AIR_%version%_ENU.msi</string>
                <key>cab_dir</key>
                <string>adm</string>
                <key>cab_file</key>
                <string>Data1</string>
                <key>embed_cab</key>
                <string>True</string>
            </dict>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\adm\Adobe_AIR_%version%_ENU.msi</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\Adobe_AIR_%version%_ENU.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSITransformer</string>
			<key>Comment</key>
			<string>Applies the Settings-Transform to the AIR.msi in the release folder</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\Adobe_AIR_%version%_ENU.msi</string>
                <key>mst_paths</key>
                    <string>%BUILD_DIR%\%pkg_dir%\helpers\AIR-Corp-config.mst</string>
                <key>mode</key>
                <string>-a</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIApplySumInfo</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\Adobe_AIR_%version%_ENU.msi</string>
                <key>cmnds_sinfo</key>			
				<dict>
				    <key>/o</key>
                    <string>Slightely altered version for ETHZ ID. %us_date% by AutoPkg</string>
				    <key>/j</key>
                    <string>Adobe AIR Runtime %version%</string>
				    <key>/t</key>
                    <string>Adobe AIR Runtime %version%</string>
				</dict>
            </dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-Adobe_AIR_%version%_ENU.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.0\.0\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-Adobe_AIR_%version%_ENU.txt</string>
                <key>new_ver</key>
                <string>%version%</string>
                <key>re_pattern</key>
                <string>[0-9][0-9]\.0\.0\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>