<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Adobe Flash Player ActiveX Plugin MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>com.github.NickETH.download.AdobeFlashPlayerAX-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AdobeFlashPlayerActiveX</string>
        <key>SEARCH_URL</key>
        <string>http://fpdownload2.macromedia.com/get/flashplayer/update/current/xml/version_en_win_ax.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>&lt;update version=&quot;(?P&lt;ver_major&gt;[0-9]+),0,0,(?P&lt;ver_minor&gt;[0-9]+)&quot;&gt;</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%match%</string>
                <key>rename_var</key>
                <string>pkg_path</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://fpdownload.adobe.com/get/flashplayer/pdc/%ver_major%.0.0.%ver_minor%/install_flash_player_%ver_major%_active_x.msi</string>
                <key>filename</key>
                <string>%NAME%.msi</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>