<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Alters latest Inkscape MSI-file for Windows.</string>
    <key>Identifier</key>
    <string>ch.ethz.gitlab.id-cd-win.build.Inkscape-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Inkscape</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>PF_STRING</key>
        <string>_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg-win.download.Inkscape-Win</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
			<string>Create the build environment</string>

            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>pkg_dir</key>
                <string>%NAME%%PF_STRING%_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourceunzipped:release:read</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%NAME%%PF_STRING%_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
			<string>Save a copy of the downloaded MSI to the release dir.</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSIRunSQL</string>
			<key>Comment</key>
			<string>Change a few settings in the iTunes MSI-file</string>
            <key>Arguments</key>
            <dict>
                <key>msi_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\release\%NAME%%PF_STRING%_%build_ver%_ML.msi</string>
                <key>SQL_command</key>
				<array>
					<string><![CDATA[UPDATE `Component` SET `Component`.`Condition`='DESKTOPSC=1' WHERE `Component`.`Component`='CM_SHORTCUT_DESKTOP_inkscape']]></string>
					<string><![CDATA[INSERT INTO `AppSearch` (`AppSearch`.`Property`,`AppSearch`.`Signature_`) VALUES ('SHORTCUTDIR','SC_Dir')]]></string>
					<string><![CDATA[INSERT INTO `RegLocator` (`RegLocator`.`Signature_`,`RegLocator`.`Root`,`RegLocator`.`Key`,`RegLocator`.`Name`,`RegLocator`.`Type`) VALUES ('SC_Dir','2','Software\Microsoft\Windows\CurrentVersion\Uninstall\[ProductCode]','ShortcutDirectory','2')]]></string>
					<string><![CDATA[INSERT INTO `Registry` (`Registry`.`Registry`,`Registry`.`Root`,`Registry`.`Key`,`Registry`.`Name`,`Registry`.`Value`,`Registry`.`Component_`) VALUES ('regARP1','-1','Software\Microsoft\Windows\CurrentVersion\Uninstall\[ProductCode]','ShortcutDirectory','[SHORTCUTDIR]','CM_SHORTCUT_inkscape')]]></string>
					<string><![CDATA[INSERT INTO `Directory` (`Directory`.`Directory`,`Directory`.`Directory_Parent`,`Directory`.`DefaultDir`) VALUES ('SHORTCUTDIR','ProgramMenuFolder','Graphics')]]></string>
					<string><![CDATA[UPDATE `Shortcut` SET `Shortcut`.`Directory_`='SHORTCUTDIR' WHERE `Shortcut`.`Component_`='CM_SHORTCUT_inkscape']]></string>
					<string><![CDATA[INSERT INTO `Upgrade` (`Upgrade`.`UpgradeCode`,`Upgrade`.`VersionMin`,`Upgrade`.`VersionMax`,`Upgrade`.`Attributes`,`Upgrade`.`ActionProperty`) VALUES ('{DE920DF4-C143-45D5-93E1-B1A88C678E8C}','0.40.0','0.48.5','260','UPGRADE_2')]]></string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+\.[0-9]+</string>				
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>