<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current Notepad++ x64 release to an MSI-package.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.build.NotepadPlusPlus-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Notepad++</string>
        <key>PLATFORM</key>
        <string>x64</string>
        <key>PF_STRING</key>
        <string>_64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg-win.download.NotepadPlusPlus-Win64</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
            <string>Create a build enviroment to build the MSI with Wix</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>4</string>
                <key>pkg_dir</key>
				<string>%NAME%%PF_STRING%_::VVeerrssiioonn::_ML</string>
                <key>folder_list</key>
                <string>sourcepkt:sourceunzipped:release:read:helpers:wixproject:wixproject\%NAME%:wixproject\Includes:wixproject\Resources:wixproject\Lang:wixproject\Fragments</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>%NAME%%PF_STRING%_%build_ver%_ML</string>
                <key>rename_var</key>
                <string>pkg_dir</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the Notepad++ installer exe file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%NAME%.exe</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the Notepad++ installer zip file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%NAME%.zip</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%.zip</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the Notepad++ installer</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%.zip</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%</string>
                <key>preserve_paths</key>
                <string>True</string>
                <key>extract_file</key>
                <string>*</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the Notepad++ installer</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%NAME%.exe</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%</string>
                <key>preserve_paths</key>
                <string>True</string>
                <key>extract_file</key>
                <string>NppShell_06.dll</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
<!--         <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>notepad-plus-plus/nppPluginList</string>
				<key>include_prereleases</key>
				<string>true</string>
				<key>asset_regex</key>
				<string>zipball/v1.3.9</string>
			</dict>
		</dict> -->
	    <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://api.github.com/repos/notepad-plus-plus/nppPluginList/releases</string>
                <key>re_pattern</key>
                <string>"zipball_url": "(?P&lt;pluginlist_url&gt;https://api.github.com/repos/notepad-plus-plus/nppPluginList/zipball/v(?P&lt;zipversion&gt;([0-9]+\.)*[0-9]+))</string>
            </dict>
        </dict>
<!--         <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>https://github.com/notepad-plus-plus/nppPluginList/archive/refs/tags/v%version%.zip</string>
                <key>rename_var</key>
                <string>pluginlist_url</string>
            </dict>
		</dict> -->
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%pluginlist_url%</string>
                <key>filename</key>
                <string>nppPluginList.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\</string>
                <key>preserve_paths</key>
                <string>False</string>
                <key>recursive</key>
                <string>True</string>
                <key>extract_file</key>
                <string>*\pl.x64.json</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
			<string>com.github.autopkg-win.SharedProcessors/TextFileSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>file_to_open</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\pl.x64.json</string>
                <key>re_pattern</key>
				<!-- <string>https://github.com/pnedev/compare-plugin/releases/download/v2.0.0/ComparePlugin_v2.0.0_X64.zip</string> -->
                <string>https://github.com/.*/compare-plugin/releases/download/v[0-9.]+/ComparePlugin_v[0-9.]+_X64.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>compareplugin.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the Notepad++ installer</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\plugins\ComparePlugin</string>
                <key>preserve_paths</key>
                <string>False</string>
                <key>extract_file</key>
                <string>*</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
			<string>com.github.autopkg-win.SharedProcessors/TextFileSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>file_to_open</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourceunzipped\pl.x64.json</string>
                <key>re_pattern</key>
				<!-- <string>https://sourceforge.net/projects/jsminnpp/files/Uni/JSToolNPP.1.1903.0.uni.64.zip</string> -->
                <string>https://sourceforge.net/.*/JSToolNPP[0-9.]+uni.64.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>jstoolplugin.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the Notepad++ installer</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\plugins\JSMinNPP</string>
                <key>preserve_paths</key>
                <string>False</string>
                <key>extract_file</key>
                <string>*</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>chcg/NPP_HexEdit</string>
				<key>include_prereleases</key>
				<string>true</string>
				<key>asset_regex</key>
				<string>HexEditor_([0-9]+\.)*[0-9]+_x64.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.sebtomasi.SharedProcessors/RenameVar</string>
            <key>Arguments</key>
            <dict>
                <key>input_var</key>
                <string>https://github.com/chcg/NPP_HexEdit/releases/download/%version%/HexEditor_%version%_x64.zip</string>
                <key>rename_var</key>
                <string>hexplugin_url</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%hexplugin_url%</string>
                <key>filename</key>
                <string>hexeditplugin.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/SevenZipExtractor</string>
            <key>Comment</key>
            <string>Extract the Notepad++ installer</string>
            <key>Arguments</key>
            <dict>
                <key>exe_path</key>
                <string>%pathname%</string>
                <key>extract_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%\plugins\HexEditor</string>
                <key>preserve_paths</key>
                <string>False</string>
                <key>extract_file</key>
                <string>*</string>
                <key>ignore_pattern</key>
                <string></string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\read\create-log-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
				<string>%BUILD_DIR%\%pkg_dir%\read\readme-%NAME%%PF_STRING%_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
			<key>Comment</key>
            <string>Set the actual version strings to the version.wxi file</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%build_ver%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSBuildRun</string>
			<key>Comment</key>
            <string>Run the MSBuild script to generate the Notepad++ MSI installer</string>
            <key>Arguments</key>
            <dict>
                <key>build_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%.build</string>
                <key>build_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>build_target</key>
                <string>WIX</string>
                <key>build_property</key>
                <string>BuildPlatform=%PLATFORM%;BuildName=%NAME%;BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;SourceDir=%BUILD_DIR%\%pkg_dir%\wixproject\%NAME%;version=%build_ver%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
	</array>
</dict>
</plist>
