<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Notepad++ x64 for Windows.</string>
    <key>Identifier</key>
    <string>com.github.autopkg-win.download.NotepadPlusPlus-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Notepad++</string>
        <key>SEARCH_URL</key>
        <string>https://notepad-plus-plus.org</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://notepad-plus-plus.org/update/getDownloadUrl.php</string>
                <key>re_pattern</key>
                <string><![CDATA[<Version>(?P<version>[0-9.]+)</Version>]]></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://notepad-plus-plus.org/update/getDownloadUrl.php</string>
                <key>re_pattern</key>
                <string><![CDATA[<Location>(?P<url>http.*)Installer.exe<\/Location>]]></string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <!-- <string>%url%x64.exe</string> -->
				<string>%url%portable.x64.zip</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%Installer.x64.exe</string>
				<!-- <string>%url%portable.x64.zip</string> -->
                <key>filename</key>
                <string>%NAME%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>WindowsSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%</string>
                <key>expected_subject</key>
                <string>CN="Notepad++", O="Notepad++", L=Saint Cloud, S=Ile-de-France, C=FR</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
