<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current R x64 release to an MSI-package.</string>
    <key>Identifier</key>
	<string>com.github.autopkg-win.build.R-Win64</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>R</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.5</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg-win.download.R-Win64</string>

    <key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>download_changed == False</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/CreateNextBuild</string>
			<key>Comment</key>
            <string>Create a build enviroment to build the MSI with Wix</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%</string>
                <key>recipe_dir</key>
                <string>%RECIPE_DIR%</string>
                <key>recipe_path</key>
                <string>%RECIPE_PATH%</string>
                <key>org_ver</key>
                <string>%version%</string>
                <key>ver_fields</key>
                <string>3</string>
                <key>pkg_dir</key>
                <string>%NAME%_64_%version%_ML</string>
                <key>folder_list</key>
                <string>sourcepkt:release:read:helpers:wixproject\R</string>
                <key>BuildFiles</key>
                <string>NextVerFiles.txt</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the MiKTeX install zip file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%\downloads\%filename%</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\%filename%</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>run the R setup and install it to C:\APPS</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt\R.exe</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>cmdline_args</key>
				<array>
					<string>/VERYSILENT</string>
					<string>/DIR="C:\APPS\R\R-%version%"</string>
                    <string>/COMPONENTS="main,x64,translations"</string>
 					<string>/TASKS="recordversion,associate"</string>
					<string>/LANG=en</string>
				</array>
                <key>run_elevated</key>
				<string>true</string>
			</dict>
        </dict>
     <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>run the Rterm and install additional packages</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>C:\APPS\R\R-%version%\bin\x64\Rterm.exe</string>
                <key>exe_folder</key>
                <string>C:\APPS\R\R-%version%</string>
                <key>cmdline_args</key>
				<array>
                    <string>--no-restore</string>
					<string>--no-save</string>
					<string>--file=%BUILD_DIR%\%pkg_dir%\helpers\install-r-pkg-STUD_AP_4x.txt</string>
					<string>--args</string>
					<string>&gt;%BUILD_DIR%\%pkg_dir%\helpers\install-r-pkg-STUD_AP_4x.log</string>
				</array>
                <key>run_elevated</key>
				<string>true</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the Renviron.site file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\helpers\Renviron.site</string>
                <key>destination_path</key>
                <string>C:\APPS\R\R-%version%\etc\Renviron.site</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>Compress the R folder with 7zip to a self extracting archive</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>%SZIP_PATH%</string>
                <key>exe_folder</key>
                <string>C:\APPS\R</string>
                <key>cmdline_args</key>
				<array>
					<string>a</string>
					<string>-r</string>
					<string>-sfx</string>
					<string>-t7z</string>
					<string>-v1900m</string>
					<string>-mx9</string>
                    <string>%BUILD_DIR%\%pkg_dir%\release\Rfiles.exe</string>
					<string>C:\APPS\R\*.*</string>
				</array>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
			<key>Comment</key>
            <string>Copy the Rgui.exe file to the build dir</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>C:\APPS\R\R-%version%\bin\x64\Rgui.exe</string>
                <key>destination_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\R\Rgui.exe</string>
                <key>overwrite</key>
                <string>true</string>
            </dict>
        </dict>		
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\create-log-R_64_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>file_path</key>
                <string>%BUILD_DIR%\%pkg_dir%\read\readme-R_64_%build_ver%_ML.txt</string>
                <key>new_ver</key>
                <string>%build_ver%</string>
                <key>re_pattern</key>
                <string>[0-9]+\.[0-9]+\.[0-9]+</string>
            </dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/FileDateVersionSubst</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/WixDefaults</string>
			<key>Comment</key>
            <string>Set the actual version strings to the version.wxi file</string>
            <key>Arguments</key>
            <dict>
                <key>build_dir</key>
                <string>%BUILD_DIR%\%pkg_dir%</string>
                <key>build_ver</key>
                <string>%build_ver%</string>
                <key>org_ver</key>
                <string>%build_ver%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/MSBuildRun</string>
			<key>Comment</key>
            <string>Run the MSBuild script to generate the R MSI installer</string>
            <key>Arguments</key>
            <dict>
                <key>build_file</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject\R.build</string>
                <key>build_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\wixproject</string>
                <key>build_target</key>
                <string>WIX</string>
                <key>build_property</key>
                <string>BuildDir=%BUILD_DIR%\%pkg_dir%\wixproject;AppDir=%BUILD_DIR%\%pkg_dir%\wixproject\R;version=%version%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>run the R setup and uninstall from C:\APPS</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>C:\APPS\R\R-%version%\unins000.exe</string>
                <key>exe_folder</key>
                <string>%BUILD_DIR%\%pkg_dir%\sourcepkt</string>
                <key>cmdline_args</key>
				<array>
                    <string>/VERYSILENT</string>
				</array>
                <key>run_elevated</key>
				<string>true</string>
			</dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/ExecuteFile</string>
			<key>Comment</key>
            <string>clean up the R folder from C:\APPS</string>
            <key>Arguments</key>
            <dict>
                <key>exe_file</key>
                <string>cmd.exe</string>
                <key>exe_folder</key>
                <string>C:\APPS</string>
                <key>cmdline_args</key>
				<array>
                    <string>/c</string>
					<string>rmdir</string>
					<string>/S</string>
					<string>/Q</string>
					<string>C:\APPS\R</string>
				</array>
                <key>run_elevated</key>
				<string>true</string>
			</dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>com.github.autopkg-win.SharedProcessors/DateTimeStamps</string>
        </dict>
	</array>
</dict>
</plist>
